## Plan Result (sbox-shutter)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;safe-settings&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;safe-settings&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;safe-settings&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;safe-settings&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["safe-settings"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-safe-settings-shutter-sbox"
      + origin_host_header            = "hmctssafesettshuttersbox.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-safe-settings"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-sbox-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + origin {
          + host_name  = "hmctssafesettshuttersbox.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctssafesettshuttersbox-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_profile.main["safe-settings"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-safe-settings"
      + resource_group_name = "shutter-app-sbox-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["safe-settings"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "safe-settings"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "safe-settings.sandbox.platform.hmcts.net"
          + "name"     = "hmcts-shutter-safe-settings/hmcts-safe-settings-shutter-sbox/safe-settings-sandbox-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-sbox-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["safe-settings"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "97b3da79fdf844c9b0885938bf828e61"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1540,"Program":"tfcmt","SHA1":"","Target":"sbox-shutter","Vars":{}} -->